Tekla Open API Reference for Tekla Structures 2025
AnalysisResult.ObjectId Property
 The identifier of the object. If ObjectType is OBJECT_TYPE_PART, ObjectId is (physical) part ID. If ObjectType is OBJECT_TYPE_MEMBER, ObjectId is the bar number when analysis bars are used in integration, otherwise ObjectId is the member number. If ObjectType is OBJECT_TYPE_AREA, ObjectId is the area number.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public int ObjectId { get; set; }
Public Property ObjectId As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
AnalysisResult Class
Tekla.Structures.Analysis Namespace